dragon-escape-backend/app/controllers/scores_controller.rb

    def update

        score = Score.all.find(params[:id])
        score.high_score = params[:high_score]
        score.save
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "scores" SET "high_score" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["high_score", 7], ["updated_at", "2020-06-18 14:18:40.867278"], ["id", 5]]