dragon-escape-backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "highest_score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "sdad"], ["highest_score", "0"], ["created_at", "2020-06-16 16:54:50.832724"], ["updated_at", "2020-06-16 16:54:50.832724"]]
INSERT INTO "scores" ("user_id", "game", "high_score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["game", "Tetris"], ["high_score", 0], ["created_at", "2020-06-18 15:41:33.041357"], ["updated_at", "2020-06-18 15:41:33.041357"]]
INSERT INTO "scores" ("user_id", "game", "high_score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["game", "Flappy Bird"], ["high_score", 0], ["created_at", "2020-06-18 15:41:33.355874"], ["updated_at", "2020-06-18 15:41:33.355874"]]
INSERT INTO "scores" ("user_id", "game", "high_score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["game", "Ping-Pong"], ["high_score", 0], ["created_at", "2020-06-18 15:41:33.732410"], ["updated_at", "2020-06-18 15:41:33.732410"]]
---
    def create
        user = User.new(username: params[:username])
        user.save
        Score.create(user_id: user.id, game:"Tetris",high_score: 0)
        Score.create(user_id: user.id, game:"Flappy Bird",high_score: 0)
        Score.create(user_id: user.id, game:"Ping-Pong",high_score: 0)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 9]]
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 63]]
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 13]]
---
    def destroy
        # byebug
        user = User.all.find(params[:id])
        user.scores.destroy_all
        user.destroy